CSI API ETABS v1
cLinkObj.GetProperty Method
 Retrieves the link property assigned to a link object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetProperty(
	string Name,
	ref string PropName
)
Function GetProperty (
	Name As String,
	ByRef PropName As String
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim PropName As String
Dim returnValue As Integer
returnValue = instance.GetProperty(Name,
	PropName)
int GetProperty(
	String^ Name,
	String^% PropName
)
abstract GetProperty :
        Name : string *
        PropName : string byref -> int
Parameters
Name
Type: System.String
The name of an existing link object.
PropName
Type: System.String
This is the name of a link property assigned to the link object.
Return Value
Type: Int32
Returns zero if the property is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim PropName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'set link property
       ret = SapModel.LinkObj.SetProperty(Name, "Link1")
   'get link property
       ret = SapModel.LinkObj.GetProperty(Name, PropName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace